name: "secondary_structure_model"
platform: "onnxruntime_onnx"
max_batch_size: 16

input [
  {
    name: "input"
    data_type: TYPE_FP32
    dims: [ -1, 1024 ]  # ProtT5 embeddings
  }
]

output [
  {
    name: "output"
    data_type: TYPE_FP32
    dims: [ -1, 3 ]  # 3 secondary structure classes (H, E, C)
  }
]

dynamic_batching {
  preferred_batch_size: [ 4, 8, 16 ]
  max_queue_delay_microseconds: 5000
}

instance_group [
  {
    count: 1
    kind: KIND_GPU
  }
]